app/controllers/bedrijfs_controller.rb

  def index
    @bedrijf = @current_user
    @category = Category.find(params[:category_id])
    if (params[:search].nil?)
      @bedrijfs = @category.bedrijfs

    else
      @bedrijfs = Bedrijf.search(params[:search])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `bedrijfs` WHERE (`bedrijfs`.category_id = 1)

  def show
      @bedrijf = @current_user
      @category = Category.find(params[:category_id])
      @bedrijf = @category.bedrijfs.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `bedrijfs` WHERE (`bedrijfs`.`id` = 1 AND (`bedrijfs`.category_id = 1))

    def new
      @bedrijf = @current_user
      @category = Category.find(params[:category_id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)

    def edit
      @category = Category.find(params[:category_id])
      @bedrijf = @category.bedrijfs.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `bedrijfs` WHERE (`bedrijfs`.`id` = 1 AND (`bedrijfs`.category_id = 1))

    def create
      @category = Category.find(params[:category_id])
      @bedrijf = @category.bedrijfs.build(params[:bedrijf])
      if @bedrijf.save
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
INSERT INTO `bedrijfs` (`kvk`, `status`, `updated_at`, `postcode`, `webadres`, `plaats`, `faxnr`, `category_id`, `adres`, `naam`, `telnr`, `created_at`) VALUES(24329956, 'Actief', '2010-04-20 13:58:55', '1234XX', 'www.memocom.nl', 'Rotterdam', 123456789, 1, 'Zuidplein 700/500', 'Memocom', 123456789, '2010-04-20 13:58:55')

    def update
      @category = Category.find(params[:category_id])
      @bedrijf = Bedrijf.find(params[:id])
      if @bedrijf.update_attributes(params[:bedrijf])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `bedrijfs` WHERE (`bedrijfs`.`id` = 1)
UPDATE `bedrijfs` SET `kvk` = 321100180000, `updated_at` = '2010-04-20 20:12:03' WHERE `id` = 1

    def destroy
      @category = Category.find(params[:category_id])
      @bedrijf = Bedrijf.find(params[:id])
      @bedrijf.destroy
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `bedrijfs` WHERE (`bedrijfs`.`id` = 3)
DELETE FROM `bedrijfs` WHERE `id` = 3