app/controllers/categories_controller.rb

  def index
    @category = @current_user
    @categories = Category.all
---
SELECT * FROM `categories`

  def show
    @category = @current_user
    @category = Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
UPDATE `categories` SET `beschrijving` = 'manger manger!!', `updated_at` = '2010-04-15 14:33:54' WHERE `id` = 1

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`updated_at`, `naam`, `beschrijving`, `created_at`) VALUES('2010-04-15 14:21:36', 'Foods', 'like Mcdonalds', '2010-04-15 14:21:36')