app/controllers/search_controller.rb

SELECT * FROM `bedrijfs`
---
  def index
    @bedrijfs = Bedrijf.all

SELECT * FROM `bedrijfs` WHERE (naam LIKE '%memo%')
---
  def search
    @bedrijfs = Bedrijf.search(params[:search])

SELECT * FROM `bedrijfs` WHERE (`bedrijfs`.`id` = 1)
---
  def show
    @bedrijf = Bedrijf.find(params[:id])