app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`last_login_at`, `updated_at`, `last_request_at`, `crypted_password`, `current_login_ip`, `username`, `password_salt`, `current_login_at`, `post_code`, `plaats`, `tel_nummer`, `adres`, `persistence_token`, `login_count`, `first_name`, `last_name`, `created_at`, `last_login_ip`) VALUES(NULL, '2010-04-15 12:20:48', '2010-04-15 12:20:48', '4e0491d9e6f1d454188a3e4fac560340179e3efa8113c2ea0c045bca74cc987ebd9f688f258e7b022d3f85623926fb647b6ca733d52d4ac1633556ece856512e', '127.0.0.1', 'machouahi', 'wgWAsZxy8rDkImZEKIjD', '2010-04-15 12:20:48', '3705PE', 'Zeist', 1234567, 'Gerrit jan van der veenlaan 15', '316f3c29def1d8f5784a7a456ef74b7f82cfa472dbf022643d4d169496e018abcd6c077f9c58a0c3081442aaed225be56e1fafdf2ed41c57f1296ef5111e2fef', 1, 'Redouan', 'Machouahi', '2010-04-15 12:20:48', NULL)

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if
      @user.update_attributes(params[:user])
---
UPDATE `users` SET `login_count` = 2, `persistence_token` = 'bacf49b4ec95326356e9a6df6713ee59070cc5e7898a3c0276ea8284bdb7cd36014dd048fed77d29a19255a17b6564325b1c1c6c8e6d288ae9d64056d9a6b435', `login` = 'machouahi', `crypted_password` = '16b8ba0542e268903e96fef90d10c963cce5cdd25c0b5ac545f33413d5590e4628f364ad20ba9efc7a0f3d80c9ef6463c6903861a55306a2cbf8bd60ecff4fcf', `last_login_at` = '2010-04-15 09:57:47', `last_login_ip` = '127.0.0.1', `updated_at` = '2010-04-15 10:03:28', `last_request_at` = '2010-04-15 10:03:28', `current_login_at` = '2010-04-15 10:03:28', `password_salt` = 'ac_Rm4wD7sqfbqEWi_w3' WHERE `id` = 1